In [201]:

import os, json
import numpy as np, pandas as pd

from pprint import pprint
from datetime import datetime as dt

In [202]:

#team_for_code = 'Chennai Super Kings'
#team_for_code = 'Lucknow Super Giants'

#team_for_code = 'Punjab Kings'
#team_for_code = 'Mumbai Indians'

#G47 SRH v KKR
team_for_code = 'Sunrisers Hyderabad'
#team_for_code = 'Kolkata Knight Riders'

In [203]:

csv_location = 'C:\\Users\\karan\\Documents\\Cricket-Analytics\\IPL\\Data\\ipl_json_bbb\\'
exp_location = 'C:\\Users\\karan\\Documents\\Cricket-Analytics\\IPL\\Data\\exp\\'

In [204]:

print(csv_location)
print()
print(exp_location)
print()
print(dt.now().date())

C:\Users\karan\Documents\Cricket-Analytics\IPL\Data\ipl_json_bbb\

C:\Users\karan\Documents\Cricket-Analytics\IPL\Data\exp\

2023-05-03

In [205]:

folder_path = csv_location

# Get a list of all files and directories in the folder
all_files_and_dirs = os.listdir(folder_path)

# Filter the list to include only files (exclude directories)
files_only = [f for f in all_files_and_dirs if os.path.isfile(os.path.join(folder_path, f))]

# Print total # of files
print(len(files_only))

# Print names of first few files 
pprint(files_only[:5])

44
['2023_10_Sunrisers Hyderabad vs Lucknow Super Giants.csv',
 '2023_11_Rajasthan Royals vs Delhi Capitals.csv',
 '2023_12_Mumbai Indians vs Chennai Super Kings.csv',
 '2023_13_Gujarat Titans vs Kolkata Knight Riders.csv',
 '2023_14_Punjab Kings vs Sunrisers Hyderabad.csv']

In [206]:

files_list = files_only
total_files = len(files_list)

#print(np.arange(total_files))
print(total_files)

44

In [207]:

#All file numbers > 1359475 are #2023 IPL onwards
#All file numbers > 1304047 are #2022 IPL onwards

In [208]:

# initialize an empty DataFrame to store all the data
pre_master_df = pd.DataFrame()

# iterate through each file in the directory
for file_name in os.listdir(csv_location):
    if file_name.endswith('.csv'):
        # read the CSV file into a DataFrame
        file_path = os.path.join(csv_location, file_name)
        df = pd.read_csv(file_path)
        
        # append the data to the master DataFrame
        pre_master_df = pre_master_df.append(df)

# print the master DataFrame
print(pre_master_df.shape)

(10796, 20)

In [209]:

print(pre_master_df.columns.values.tolist())

['inn', 'bat_tm', 'batnum', 'bat', 'ball', 'over_num', 'bow', 'runs', 'wkt', 'wkt_how', 'b.cnt', 'f.ov.powp', 'f.ov.midd', 'f.ov.deat', 'm.grnd', 'm.date', 'ss', 'm.type', 'm.num', 'm.vs']

In [210]:

display(pre_master_df.head(3))

,inn,bat_tm,batnum,bat,ball,over_num,bow,runs,wkt,wkt_how,b.cnt,f.ov.powp,f.ov.midd,f.ov.deat,m.grnd,m.date,ss,m.type,m.num,m.vs
0,1,Sunrisers Hyderabad,1,Anmolpreet Singh,0,0,KR Mayers,1,0,NaN,1,1,0,0,Lucknow,2023-04-07,2023,T20,10,Sunrisers Hyderabad vs Lucknow Super Giants
1,1,Sunrisers Hyderabad,2,MA Agarwal,1,0,KR Mayers,1,0,NaN,1,1,0,0,Lucknow,2023-04-07,2023,T20,10,Sunrisers Hyderabad vs Lucknow Super Giants
2,1,Sunrisers Hyderabad,1,Anmolpreet Singh,2,0,KR Mayers,1,0,NaN,1,1,0,0,Lucknow,2023-04-07,2023,T20,10,Sunrisers Hyderabad vs Lucknow Super Giants

In [211]:

pre_master_df.describe()

,inn,batnum,ball,over_num,runs,wkt,wkt_how,b.cnt,f.ov.powp,f.ov.midd,f.ov.deat,ss,m.num
count,10796.000000,10796.00000,10796.000000,10796.000000,10796.000000,10796.000000,0.0,10796.000000,10796.000000,10796.000000,10796.000000,10796.0,10796.000000
mean,1.489904,3.80289,2.640793,9.379585,1.351426,0.053168,NaN,0.960356,0.305854,0.504446,0.189700,2023.0,22.619303
std,0.499921,2.27426,1.829889,5.729396,1.721797,0.224378,NaN,0.195131,0.460790,0.500003,0.392082,0.0,12.691404
min,1.000000,1.00000,0.000000,0.000000,0.000000,0.000000,NaN,0.000000,0.000000,0.000000,0.000000,2023.0,1.000000
25%,1.000000,2.00000,1.000000,4.000000,0.000000,0.000000,NaN,1.000000,0.000000,0.000000,0.000000,2023.0,12.000000
50%,1.000000,3.00000,3.000000,9.000000,1.000000,0.000000,NaN,1.000000,0.000000,1.000000,0.000000,2023.0,23.000000
75%,2.000000,5.00000,4.000000,14.000000,1.000000,0.000000,NaN,1.000000,1.000000,1.000000,0.000000,2023.0,34.000000
max,2.000000,11.00000,10.000000,19.000000,6.000000,1.000000,NaN,1.000000,1.000000,1.000000,1.000000,2023.0,44.000000

In [212]:

print(len(pre_master_df['m.num'].unique()))
#print(pre_master_df['m.vs'].unique())

44

## Filter for Team

In [213]:

master_df = pre_master_df[pre_master_df['m.vs'].str.contains(team_for_code)]

print(master_df.shape)
print()
print(master_df.columns.values.tolist())
print()

(1959, 20)

['inn', 'bat_tm', 'batnum', 'bat', 'ball', 'over_num', 'bow', 'runs', 'wkt', 'wkt_how', 'b.cnt', 'f.ov.powp', 'f.ov.midd', 'f.ov.deat', 'm.grnd', 'm.date', 'ss', 'm.type', 'm.num', 'm.vs']

In [214]:

print(master_df.bat_tm.unique())

['Mumbai Indians' 'Chennai Super Kings' 'Delhi Capitals'
 'Kolkata Knight Riders' 'Sunrisers Hyderabad' 'Punjab Kings'
 'Gujarat Titans' 'Rajasthan Royals' 'Royal Challengers Bangalore']

In [215]:

print( master_df.groupby(['m.num','m.vs']).agg({'inn':'count'}).reset_index() )

   m.num                                           m.vs  inn
0      5  Mumbai Indians vs Royal Challengers Bangalore  232
1     12          Mumbai Indians vs Chennai Super Kings  239
2     16               Delhi Capitals vs Mumbai Indians  246
3     22        Kolkata Knight Riders vs Mumbai Indians  237
4     25          Mumbai Indians vs Sunrisers Hyderabad  249
5     31                 Punjab Kings vs Mumbai Indians  252
6     35               Gujarat Titans vs Mumbai Indians  246
7     42             Rajasthan Royals vs Mumbai Indians  258

## Batting stats

In [216]:

#bat_grouped_df = master_df.groupby(['bat_tm', 'batnum', 'bat', 'm.num'])
bat_grouped_df = master_df.groupby(['bat_tm', 'batnum', 'bat', 'm.num']) # batnum unique as the m.num per player

# Calculate the desired columns
batting_match_level_df = bat_grouped_df.agg(
    tr=('runs', 'sum'),
    tbf=('b.cnt', 'sum'),
    tbinn=('m.num', 'nunique'),
    
    tr_pp=('f.ov.powp', lambda x: (x * df['runs']).sum()),
    tbf_pp=('f.ov.powp', 'sum'),
    tout_pp=('wkt', lambda x: (x * df['f.ov.powp']).sum()),
    
    tr_mid=('f.ov.midd', lambda x: (x * df['runs']).sum()),
    tbf_mid=('f.ov.midd', 'sum'),
    tout_mid=('wkt', lambda x: (x * df['f.ov.midd']).sum()),
    
    tr_dth=('f.ov.deat', lambda x: (x * df['runs']).sum()),
    tbf_dth=('f.ov.deat', 'sum'),
    tout_dth=('wkt', lambda x: (x * df['f.ov.deat']).sum())
)

# Reset the index so that the primary key columns become regular columns
batting_match_level_df.reset_index(inplace=True)

In [217]:

display(batting_match_level_df.head(3))

,bat_tm,batnum,bat,m.num,tr,tbf,tbinn,tr_pp,tbf_pp,tout_pp,tr_mid,tbf_mid,tout_mid,tr_dth,tbf_dth,tout_dth
0,Chennai Super Kings,1,DP Conway,12,0,4,1,6,4,0,0,0,0,0,0,1
1,Chennai Super Kings,2,AM Rahane,12,61,27,1,37,20,0,2,7,1,0,0,0
2,Chennai Super Kings,3,RD Gaikwad,12,40,36,1,13,15,0,22,21,0,1,4,0

In [218]:

# Add points columns to the original DataFrame

batting_match_level_df['f.cp.pts30'] = batting_match_level_df['tr'].apply(lambda x: 4 if x >= 30 else 0)
batting_match_level_df['f.cp.pts50'] = batting_match_level_df['tr'].apply(lambda x: 8 if x >= 50 else 0)
batting_match_level_df['f.cp.pts100'] = batting_match_level_df['tr'].apply(lambda x: 16 if x >= 100 else 0)
batting_match_level_df['f.cp.pts0'] = batting_match_level_df['tr'].apply(lambda x: -2 if x == 0 else 0)

In [219]:

batting_match_level_df.describe()

,batnum,m.num,tr,tbf,tbinn,tr_pp,tbf_pp,tout_pp,tr_mid,tbf_mid,tout_mid,tr_dth,tbf_dth,tout_dth,f.cp.pts30,f.cp.pts50,f.cp.pts100,f.cp.pts0
count,127.000000,127.000000,127.000000,127.000000,127.0,127.000000,127.000000,127.000000,127.000000,127.000000,127.000000,127.000000,127.000000,127.000000,127.000000,127.000000,127.000000,127.000000
mean,4.748031,24.118110,22.007874,14.700787,1.0,5.181102,4.818898,0.141732,9.685039,7.795276,0.385827,3.889764,2.811024,0.212598,1.102362,1.007874,0.251969,-0.141732
std,2.707920,11.254357,23.250020,12.771070,0.0,9.004776,7.063676,0.350157,12.284783,9.220697,0.488718,7.280359,4.240269,0.410766,1.794324,2.665166,1.999875,0.515235
min,1.000000,5.000000,0.000000,0.000000,1.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,-2.000000
25%,2.500000,16.000000,4.000000,4.000000,1.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4.000000,25.000000,15.000000,11.000000,1.0,0.000000,0.000000,0.000000,4.000000,4.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,7.000000,35.000000,31.500000,21.000000,1.0,7.500000,10.000000,0.000000,19.000000,13.500000,1.000000,6.000000,4.000000,0.000000,4.000000,0.000000,0.000000,0.000000
max,11.000000,42.000000,124.000000,61.000000,1.0,38.000000,24.000000,1.000000,46.000000,31.000000,1.000000,39.000000,21.000000,1.000000,4.000000,8.000000,16.000000,0.000000

In [220]:

print(batting_match_level_df.shape)
print()
print(batting_match_level_df.columns.values.tolist())

(127, 20)

['bat_tm', 'batnum', 'bat', 'm.num', 'tr', 'tbf', 'tbinn', 'tr_pp', 'tbf_pp', 'tout_pp', 'tr_mid', 'tbf_mid', 'tout_mid', 'tr_dth', 'tbf_dth', 'tout_dth', 'f.cp.pts30', 'f.cp.pts50', 'f.cp.pts100', 'f.cp.pts0']

### Batting Transpose

In [221]:

df_bat_transpose = batting_match_level_df.copy()
df_bat_transpose['game.num'] = 'G' + df_bat_transpose['m.num'].astype(str).str.zfill(2)

df_bat_transpose.sort_values(by = 'm.num', ascending = False)

batting_gwise = df_bat_transpose.pivot(index= ['bat_tm','bat'], columns= ['game.num'], values= ['tr']).reset_index()

# Fixing multi-level columns
#batting_gwise.columns = batting_gwise.columns.map(lambda x: f'{x[1]}.{x[0]}')

# Flatten only multi-level column index
batting_gwise.columns = batting_gwise.columns.map( lambda x: f'{x[0]}.{x[1]}' if len(x) > 1 else x[0] )

# Reset index
batting_gwise = batting_gwise.reset_index(drop = True).rename(columns = {'bat_tm.':'bat_tm','bat.':'bat'})

In [222]:

print(batting_gwise.shape)
print()
print(batting_gwise.columns.values.tolist())

(79, 10)

['bat_tm', 'bat', 'tr.G05', 'tr.G12', 'tr.G16', 'tr.G22', 'tr.G25', 'tr.G31', 'tr.G35', 'tr.G42']

In [223]:

display(batting_gwise)

,bat_tm,bat,tr.G05,tr.G12,tr.G16,tr.G22,tr.G25,tr.G31,tr.G35,tr.G42
0,Chennai Super Kings,AM Rahane,NaN,61.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Chennai Super Kings,AT Rayudu,NaN,20.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Chennai Super Kings,DP Conway,NaN,0.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Chennai Super Kings,RD Gaikwad,NaN,40.0,NaN,NaN,NaN,NaN,NaN,NaN
4,Chennai Super Kings,S Dube,NaN,28.0,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
74,Sunrisers Hyderabad,M Jansen,NaN,NaN,NaN,NaN,13.0,NaN,NaN,NaN
75,Sunrisers Hyderabad,M Markande,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN
76,Sunrisers Hyderabad,MA Agarwal,NaN,NaN,NaN,NaN,48.0,NaN,NaN,NaN
77,Sunrisers Hyderabad,RA Tripathi,NaN,NaN,NaN,NaN,7.0,NaN,NaN,NaN
78,Sunrisers Hyderabad,Washington Sundar,NaN,NaN,NaN,NaN,10.0,NaN,NaN,NaN

### Bowling stats

In [224]:

### DICTIONARY CREATION

# Create a dictionary with the match number ('m.num') as the key and the team names as the values
team_mapping = master_df.groupby('m.num')['bat_tm'].unique().apply(list).to_dict()

# Define a function to switch the team name
def switch_team_name(team, match_num):
    teams = team_mapping[match_num]
    return teams[0] if teams[1] == team else teams[1]

# Add a new column 'bow_team' in the bowling_match_level_df
master_df = master_df.copy()
master_df['bow_tm'] = master_df.apply(lambda x: switch_team_name(x['bat_tm'], x['m.num']), axis=1)



### ROLLING UP THE DATASET
bow_grouped_df = master_df.groupby(['bow_tm', 'bow', 'm.num'])

# Calculate the bowling stats for each player by game (m.num)
bowling_match_level_df_pre = bow_grouped_df.agg(
    tbb=('b.cnt', 'sum'),
    tbrc=('runs', 'sum'),
    tbwkt=('wkt', 'sum'),
    tov=('over_num', 'nunique'),
    #tot_overs_powp=('over_num', lambda x: (((df['f.ov.powp'] * x)) | (x == 0)).nunique()),
    #tot_overs_mid=('over_num', lambda x: ( (df['f.ov.midd'] * x) !=0).nunique()),
    #tot_overs_dth=('over_num', lambda x: ( (df['f.ov.deat'] * x) !=0).nunique()),
    tbrc_powp=('runs', lambda x: (df['f.ov.powp'] * x).sum()),
    tbrc_mid=('runs', lambda x: (df['f.ov.midd'] * x).sum()),
    tbrc_dth=('runs', lambda x: (df['f.ov.deat'] * x).sum()),
    tbwkt_powp=('wkt', lambda x: (df['f.ov.powp'] * x).sum()),
    tbwkt_mid=('wkt', lambda x: (df['f.ov.midd'] * x).sum()),
    tbwkt_dth=('wkt', lambda x: (df['f.ov.deat'] * x).sum())
)

bowling_match_level_df_pre.reset_index(inplace = True)

### CALCULATING STATS
"""
# Calculate the bowling stats for each player by game (m.num)
bowling_match_level_df = bow_grouped_df.agg(
    #tot_wides=('extra_type', lambda x: (x == 'wd').sum()),
    #tot_noballs=('extra_type', lambda x: (x == 'nb').sum())
    tot_balls_bowled=('b.cnt', 'sum'),
    tot_runs_conceded=('runs', 'sum'),
    tot_wickets_taken=('wkt', 'sum')
)
"""

"\n# Calculate the bowling stats for each player by game (m.num)\nbowling_match_level_df = bow_grouped_df.agg(\n    #tot_wides=('extra_type', lambda x: (x == 'wd').sum()),\n    #tot_noballs=('extra_type', lambda x: (x == 'nb').sum())\n    tot_balls_bowled=('b.cnt', 'sum'),\n    tot_runs_conceded=('runs', 'sum'),\n    tot_wickets_taken=('wkt', 'sum')\n)\n"

In [225]:

print(team_mapping)

{5: ['Mumbai Indians', 'Royal Challengers Bangalore'], 12: ['Mumbai Indians', 'Chennai Super Kings'], 16: ['Delhi Capitals', 'Mumbai Indians'], 22: ['Kolkata Knight Riders', 'Mumbai Indians'], 25: ['Mumbai Indians', 'Sunrisers Hyderabad'], 31: ['Punjab Kings', 'Mumbai Indians'], 35: ['Gujarat Titans', 'Mumbai Indians'], 42: ['Rajasthan Royals', 'Mumbai Indians']}

In [226]:

bowling_match_level_df_pre.describe()

,m.num,tbb,tbrc,tbwkt,tov,tbrc_powp,tbrc_mid,tbrc_dth,tbwkt_powp,tbwkt_mid,tbwkt_dth
count,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000
mean,23.282828,18.858586,28.232323,1.010101,3.171717,8.080808,13.696970,5.262626,0.181818,0.494949,0.272727
std,11.624254,6.228654,10.890764,0.994833,1.030558,7.103717,11.167057,7.980315,0.413142,0.800175,0.603023
min,5.000000,6.000000,6.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,14.000000,12.000000,19.000000,0.000000,2.000000,0.000000,4.500000,0.000000,0.000000,0.000000,0.000000
50%,22.000000,24.000000,29.000000,1.000000,4.000000,8.000000,13.000000,0.000000,0.000000,0.000000,0.000000
75%,31.000000,24.000000,37.000000,2.000000,4.000000,13.000000,20.500000,9.500000,0.000000,1.000000,0.000000
max,42.000000,24.000000,53.000000,4.000000,4.000000,28.000000,43.000000,34.000000,2.000000,3.000000,4.000000

In [227]:

print(master_df.shape)

# master_df for each phase of the game
powp_df = master_df[master_df['f.ov.powp'] != 0]
mid_df = master_df[master_df['f.ov.midd'] != 0]
dth_df = master_df[master_df['f.ov.deat'] != 0]

print(powp_df.shape)
print(mid_df.shape)
print(dth_df.shape)

# Group the DataFrames by the bowler, batting team, and match number
#powp_grouped = powp_df.groupby(['bow_tm', 'bow', 'm.num']).agg(tot_ov_powp = ('over_num','nunique')).reset_index()
powp_grouped = powp_df.groupby(['bow_tm', 'bow', 'm.num']).agg({'over_num':'nunique'}).reset_index().rename(columns = {'over_num':'tov.powp'})
mid_grouped = mid_df.groupby(['bow_tm', 'bow', 'm.num']).agg({'over_num':'nunique'}).reset_index().rename(columns = {'over_num':'tov.mid'})
dth_grouped = dth_df.groupby(['bow_tm', 'bow', 'm.num']).agg({'over_num':'nunique'}).reset_index().rename(columns = {'over_num':'tov.dth'})

(1959, 21)
(612, 21)
(990, 21)
(357, 21)

In [228]:

# Reset the index of bowling_match_level_df
#bow_grouped_df.reset_index()

bowling_match_level_df = bowling_match_level_df_pre.reset_index()

# Merge the unique overs bowled in each phase back to the bowling_match_level_df
bowling_match_level_df = bowling_match_level_df.merge(powp_grouped, on=['bow_tm', 'bow', 'm.num'], how='left')
bowling_match_level_df = bowling_match_level_df.merge(mid_grouped, on=['bow_tm', 'bow', 'm.num'], how='left')
bowling_match_level_df = bowling_match_level_df.merge(dth_grouped, on=['bow_tm', 'bow', 'm.num'], how='left')

In [229]:

print(bowling_match_level_df.columns.values.tolist())

['index', 'bow_tm', 'bow', 'm.num', 'tbb', 'tbrc', 'tbwkt', 'tov', 'tbrc_powp', 'tbrc_mid', 'tbrc_dth', 'tbwkt_powp', 'tbwkt_mid', 'tbwkt_dth', 'tov.powp', 'tov.mid', 'tov.dth']

In [230]:

# BOWLING
bowling_match_level_df['f.cp.pts3w'] = bowling_match_level_df['tbwkt'].apply(lambda x : 4 if x >= 3 else 0 )
bowling_match_level_df['f.cp.pts4w'] = bowling_match_level_df['tbwkt'].apply(lambda x : 8 if x >= 4 else 0 )
bowling_match_level_df['f.cp.pts5w'] = bowling_match_level_df['tbwkt'].apply(lambda x : 16 if x >= 5 else 0 )

bowling_match_level_df['tbecon'] = ( bowling_match_level_df['tbrc'] * 6 ) / bowling_match_level_df['tbb']

bowling_match_level_df['f.cp.ptsecon'] = bowling_match_level_df.apply(lambda x : (2*6)/x.tbb if (5 <= x.tbecon) & ( x.tbecon < 6) \
                                                            else ( (4*6)/x.tbb if (5 <= x.tbecon) & ( x.tbecon < 6) else 0 )\
                                                , axis =1)

In [231]:

display(bowling_match_level_df.head(3))

,index,bow_tm,bow,m.num,tbb,tbrc,tbwkt,tov,tbrc_powp,tbrc_mid,...,tbwkt_mid,tbwkt_dth,tov.powp,tov.mid,tov.dth,f.cp.pts3w,f.cp.pts4w,f.cp.pts5w,tbecon,f.cp.ptsecon
0,0,Chennai Super Kings,D Pretorius,12,24,24,0,4,0,7,...,0,0,NaN,2.0,2.0,0,0,0,6.0,0.0
1,1,Chennai Super Kings,DL Chahar,12,6,10,0,1,10,0,...,0,0,1.0,NaN,NaN,0,0,0,10.0,0.0
2,2,Chennai Super Kings,MJ Santner,12,24,28,2,4,9,19,...,2,0,1.0,3.0,NaN,0,0,0,7.0,0.0

In [232]:

bowling_match_level_df.describe()

,index,m.num,tbb,tbrc,tbwkt,tov,tbrc_powp,tbrc_mid,tbrc_dth,tbwkt_powp,tbwkt_mid,tbwkt_dth,tov.powp,tov.mid,tov.dth,f.cp.pts3w,f.cp.pts4w,f.cp.pts5w,tbecon,f.cp.ptsecon
count,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,65.000000,76.000000,42.000000,99.000000,99.000000,99.0,99.000000,99.000000
mean,49.000000,23.282828,18.858586,28.232323,1.010101,3.171717,8.080808,13.696970,5.262626,0.181818,0.494949,0.272727,1.476923,2.105263,1.380952,0.323232,0.161616,0.0,9.378085,0.032383
std,28.722813,11.624254,6.228654,10.890764,0.994833,1.030558,7.103717,11.167057,7.980315,0.413142,0.800175,0.603023,0.615114,1.040243,0.491507,1.095709,1.131254,0.0,3.218865,0.147926
min,0.000000,5.000000,6.000000,6.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000,1.000000,0.000000,0.000000,0.0,3.750000,0.000000
25%,24.500000,14.000000,12.000000,19.000000,0.000000,2.000000,0.000000,4.500000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000,1.000000,0.000000,0.000000,0.0,7.000000,0.000000
50%,49.000000,22.000000,24.000000,29.000000,1.000000,4.000000,8.000000,13.000000,0.000000,0.000000,0.000000,0.000000,1.000000,2.000000,1.000000,0.000000,0.000000,0.0,9.000000,0.000000
75%,73.500000,31.000000,24.000000,37.000000,2.000000,4.000000,13.000000,20.500000,9.500000,0.000000,1.000000,0.000000,2.000000,3.000000,2.000000,0.000000,0.000000,0.0,11.000000,0.000000
max,98.000000,42.000000,24.000000,53.000000,4.000000,4.000000,28.000000,43.000000,34.000000,2.000000,3.000000,4.000000,3.000000,4.000000,2.000000,4.000000,8.000000,0.0,19.500000,1.000000

In [233]:

# QC
# bowling_match_level_df[bowling_match_level_df['tov.powp'] == 4]

## Bowling Transpose

In [234]:

df_bow_transpose = bowling_match_level_df.copy()
df_bow_transpose['game.num'] = 'G' + df_bow_transpose['m.num'].astype(str).str.zfill(2)

df_bow_transpose.sort_values(by = 'game.num', ascending = True)

bowling_gwise = df_bow_transpose.pivot( index= ['bow_tm','bow'], columns= ['game.num'], values= ['tbwkt'] ).reset_index()

# Fixing multi-level columns
#bowling_gwise.columns = bowling_gwise.columns.map(lambda x: f'{x[1]}.{x[0]}')

# Flatten only multi-level column index
bowling_gwise.columns = bowling_gwise.columns.map( lambda x: f'{x[0]}.{x[1]}' if len(x) > 1 else x[0] )

# Reset index
bowling_gwise = bowling_gwise.reset_index(drop = True).rename(columns = {'bow_tm.':'bow_tm','bow.':'bow'})

In [235]:

print(bowling_gwise.shape)
print()
print(bowling_gwise.columns.values.tolist())

(61, 10)

['bow_tm', 'bow', 'tbwkt.G05', 'tbwkt.G12', 'tbwkt.G16', 'tbwkt.G22', 'tbwkt.G25', 'tbwkt.G31', 'tbwkt.G35', 'tbwkt.G42']

In [236]:

display(bowling_gwise)

,bow_tm,bow,tbwkt.G05,tbwkt.G12,tbwkt.G16,tbwkt.G22,tbwkt.G25,tbwkt.G31,tbwkt.G35,tbwkt.G42
0,Chennai Super Kings,D Pretorius,NaN,0.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Chennai Super Kings,DL Chahar,NaN,0.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Chennai Super Kings,MJ Santner,NaN,2.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Chennai Super Kings,RA Jadeja,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN
4,Chennai Super Kings,SSB Magala,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
56,Sunrisers Hyderabad,B Kumar,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
57,Sunrisers Hyderabad,M Jansen,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN
58,Sunrisers Hyderabad,M Markande,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN
59,Sunrisers Hyderabad,T Natarajan,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN
60,Sunrisers Hyderabad,Washington Sundar,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN

## MERGE

In [237]:

### MERGE BAT AND BOW DF

# Reset the index for both DataFrames to prepare for merging
batmldf = batting_match_level_df.reset_index(drop = True)
bowmldf = bowling_match_level_df.reset_index(drop = True)

#dropcols = ['bow_tm','bow']
dropcols = []

# Merge the batting figures with the bowling stats
merged_df = pd.merge( batmldf, bowmldf, 
                     left_on=['bat_tm', 'bat', 'm.num'],
                     right_on=['bow_tm', 'bow', 'm.num'],
                     how='outer', 
                     suffixes=('_bat', '_bowl'))#.rename(columns = {'bat_tm':'tm', 'bat':'name' }).drop(columns = dropcols)

print(merged_df.shape)
print(merged_df.columns.values.tolist())

# Replace NaN values with 0 in the merged DataFrame
#merged_df.fillna(0, inplace=True)

(185, 41)
['bat_tm', 'batnum', 'bat', 'm.num', 'tr', 'tbf', 'tbinn', 'tr_pp', 'tbf_pp', 'tout_pp', 'tr_mid', 'tbf_mid', 'tout_mid', 'tr_dth', 'tbf_dth', 'tout_dth', 'f.cp.pts30', 'f.cp.pts50', 'f.cp.pts100', 'f.cp.pts0', 'index', 'bow_tm', 'bow', 'tbb', 'tbrc', 'tbwkt', 'tov', 'tbrc_powp', 'tbrc_mid', 'tbrc_dth', 'tbwkt_powp', 'tbwkt_mid', 'tbwkt_dth', 'tov.powp', 'tov.mid', 'tov.dth', 'f.cp.pts3w', 'f.cp.pts4w', 'f.cp.pts5w', 'tbecon', 'f.cp.ptsecon']

In [238]:

# Function to combine two columns with condition
def combine_columns(row, col1, col2):
    return row[col1] if pd.notna(row[col1]) and row[col1] != '' else row[col2]

# Create a new column using the custom function
merged_df['tm'] = merged_df.apply(lambda row: combine_columns(row, 'bat_tm', 'bow_tm'), axis=1)
merged_df['name'] = merged_df.apply(lambda row: combine_columns(row, 'bat', 'bow'), axis=1)

In [239]:

display(merged_df.tail(25))

,bat_tm,batnum,bat,m.num,tr,tbf,tbinn,tr_pp,tbf_pp,tout_pp,...,tov.powp,tov.mid,tov.dth,f.cp.pts3w,f.cp.pts4w,f.cp.pts5w,tbecon,f.cp.ptsecon,tm,name
160,NaN,NaN,NaN,35,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,4.0,NaN,0.0,0.0,0.0,9.750000,0.0,Mumbai Indians,K Kartikeya
161,NaN,NaN,NaN,42,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,2.0,NaN,0.0,0.0,0.0,7.000000,0.0,Mumbai Indians,K Kartikeya
162,NaN,NaN,NaN,5,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,3.0,NaN,0.0,0.0,0.0,6.500000,0.0,Mumbai Indians,PP Chawla
163,NaN,NaN,NaN,16,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,4.0,NaN,4.0,0.0,0.0,5.500000,0.5,Mumbai Indians,PP Chawla
164,NaN,NaN,NaN,22,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,3.0,NaN,0.0,0.0,0.0,4.750000,0.0,Mumbai Indians,PP Chawla
165,NaN,NaN,NaN,25,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,4.0,NaN,0.0,0.0,0.0,10.750000,0.0,Mumbai Indians,PP Chawla
166,NaN,NaN,NaN,31,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,2.0,NaN,0.0,0.0,0.0,4.666667,0.0,Mumbai Indians,PP Chawla
167,NaN,NaN,NaN,42,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,3.0,NaN,0.0,0.0,0.0,8.500000,0.0,Mumbai Indians,PP Chawla
168,NaN,NaN,NaN,16,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,1.0,2.0,0.0,0.0,0.0,9.000000,0.0,Mumbai Indians,RP Meredith
169,NaN,NaN,NaN,22,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,2.0,2.0,0.0,0.0,0.0,10.000000,0.0,Mumbai Indians,RP Meredith
170,NaN,NaN,NaN,25,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,2.0,1.0,0.0,0.0,0.0,7.250000,0.0,Mumbai Indians,RP Meredith
171,NaN,NaN,NaN,42,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,2.0,1.0,0.0,0.0,0.0,12.250000,0.0,Mumbai Indians,RP Meredith
172,NaN,NaN,NaN,31,NaN,NaN,NaN,NaN,NaN,NaN,...,2.0,NaN,2.0,4.0,8.0,0.0,7.000000,0.0,Punjab Kings,Arshdeep Singh
173,NaN,NaN,NaN,31,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,2.0,1.0,0.0,0.0,0.0,11.000000,0.0,Punjab Kings,NT Ellis
174,NaN,NaN,NaN,31,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,4.0,NaN,0.0,0.0,0.0,10.500000,0.0,Punjab Kings,RD Chahar
175,NaN,NaN,NaN,42,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,1.0,NaN,0.0,0.0,0.0,19.000000,0.0,Rajasthan Royals,KR Sen
176,NaN,NaN,NaN,42,NaN,NaN,NaN,NaN,NaN,NaN,...,3.0,NaN,1.0,0.0,0.0,0.0,8.250000,0.0,Rajasthan Royals,Sandeep Sharma
177,NaN,NaN,NaN,42,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,3.0,NaN,0.0,0.0,0.0,10.666667,0.0,Rajasthan Royals,YS Chahal
178,NaN,NaN,NaN,5,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,1.0,1.0,0.0,0.0,0.0,9.666667,0.0,Royal Challengers Bangalore,Akash Deep
179,NaN,NaN,NaN,5,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,2.0,2.0,0.0,0.0,0.0,10.000000,0.0,Royal Challengers Bangalore,HV Patel
180,NaN,NaN,NaN,5,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,4.0,NaN,0.0,0.0,0.0,7.750000,0.0,Royal Challengers Bangalore,KV Sharma
181,NaN,NaN,NaN,5,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,2.0,NaN,0.0,0.0,0.0,8.000000,0.0,Royal Challengers Bangalore,MG Bracewell
182,NaN,NaN,NaN,5,NaN,NaN,NaN,NaN,NaN,NaN,...,3.0,NaN,1.0,0.0,0.0,0.0,3.750000,0.0,Royal Challengers Bangalore,Mohammed Siraj
183,NaN,NaN,NaN,5,NaN,NaN,NaN,NaN,NaN,NaN,...,2.0,NaN,NaN,0.0,0.0,0.0,7.000000,0.0,Royal Challengers Bangalore,RJW Topley
184,NaN,NaN,NaN,25,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,1.0,2.0,0.0,0.0,0.0,12.500000,0.0,Sunrisers Hyderabad,T Natarajan

In [240]:

#merged_df.to_csv(exp_location + 'merged.csv', index = False)

### MAIN RUP

In [241]:

#### Rollup at a Player Level

# Replace NaN values with False in the mask
mask = merged_df.tm.str.contains(team_for_code).fillna(False)

# Apply the mask to filter the DataFrame
#merged_for_team_only = merged_df[merged_df.tm.str.contains(team_for_code)]
merged_for_team_only = merged_df[mask]

pstats = merged_for_team_only.groupby(['tm', 'name']).agg({
    'batnum': np.min,
    'm.num': 'nunique',
    'tr': 'sum',
    'tbf': 'sum',
    'tbinn': 'sum',
    'tr_pp': 'sum',
    'tbf_pp': 'sum',
    'tout_pp': 'sum',
    'tr_mid': 'sum',
    'tbf_mid': 'sum',
    'tout_mid': 'sum',
    'tr_dth': 'sum',
    'tbf_dth': 'sum',
    'tout_dth': 'sum',
    'f.cp.pts30': 'sum',
    'f.cp.pts50': 'sum',
    'f.cp.pts100': 'sum',
    'f.cp.pts0': 'sum',
    'tbb': 'sum',
    'tbrc': 'sum',
    'tbwkt': 'sum',
    'tov': 'sum',
    'tov.powp':'sum', 
    'tov.mid':'sum', 
    'tov.dth':'sum',
    'tbrc_powp': 'sum',
    'tbrc_mid': 'sum',
    'tbrc_dth': 'sum',
    'tbwkt_powp': 'sum',
    'tbwkt_mid': 'sum',
    'tbwkt_dth': 'sum'
}).reset_index().rename(columns = {'batnum' : 'batnum_min'})

print(pstats.shape)

(17, 33)

In [242]:

print(pstats.columns.values.tolist())

['tm', 'name', 'batnum_min', 'm.num', 'tr', 'tbf', 'tbinn', 'tr_pp', 'tbf_pp', 'tout_pp', 'tr_mid', 'tbf_mid', 'tout_mid', 'tr_dth', 'tbf_dth', 'tout_dth', 'f.cp.pts30', 'f.cp.pts50', 'f.cp.pts100', 'f.cp.pts0', 'tbb', 'tbrc', 'tbwkt', 'tov', 'tov.powp', 'tov.mid', 'tov.dth', 'tbrc_powp', 'tbrc_mid', 'tbrc_dth', 'tbwkt_powp', 'tbwkt_mid', 'tbwkt_dth']

In [243]:
# Now check the gwise battin and bowling stats to append to pstats

In [244]:

print(batting_gwise.columns.values.tolist())
print()
print(bowling_gwise.columns.values.tolist())
print()

['bat_tm', 'bat', 'tr.G05', 'tr.G12', 'tr.G16', 'tr.G22', 'tr.G25', 'tr.G31', 'tr.G35', 'tr.G42']

['bow_tm', 'bow', 'tbwkt.G05', 'tbwkt.G12', 'tbwkt.G16', 'tbwkt.G22', 'tbwkt.G25', 'tbwkt.G31', 'tbwkt.G35', 'tbwkt.G42']

In [245]:

# Merge the batting & bowling gwise stats
merged_interim_df1 = pd.merge( pstats, batting_gwise,
                     left_on=['tm', 'name'],
                     right_on=['bat_tm', 'bat'],
                     how='left' )

print()
print(merged_interim_df1.shape)
print(merged_interim_df1.columns.values.tolist())


# Merge the batting & bowling gwise stats
merged_interim_df2 = pd.merge( merged_interim_df1, bowling_gwise, 
                     left_on=['tm', 'name'],
                     right_on=['bow_tm', 'bow'],
                     how='left' )

print()
print(merged_interim_df2.shape)
print(merged_interim_df2.columns.values.tolist())

(17, 43)
['tm', 'name', 'batnum_min', 'm.num', 'tr', 'tbf', 'tbinn', 'tr_pp', 'tbf_pp', 'tout_pp', 'tr_mid', 'tbf_mid', 'tout_mid', 'tr_dth', 'tbf_dth', 'tout_dth', 'f.cp.pts30', 'f.cp.pts50', 'f.cp.pts100', 'f.cp.pts0', 'tbb', 'tbrc', 'tbwkt', 'tov', 'tov.powp', 'tov.mid', 'tov.dth', 'tbrc_powp', 'tbrc_mid', 'tbrc_dth', 'tbwkt_powp', 'tbwkt_mid', 'tbwkt_dth', 'bat_tm', 'bat', 'tr.G05', 'tr.G12', 'tr.G16', 'tr.G22', 'tr.G25', 'tr.G31', 'tr.G35', 'tr.G42']

(17, 53)
['tm', 'name', 'batnum_min', 'm.num', 'tr', 'tbf', 'tbinn', 'tr_pp', 'tbf_pp', 'tout_pp', 'tr_mid', 'tbf_mid', 'tout_mid', 'tr_dth', 'tbf_dth', 'tout_dth', 'f.cp.pts30', 'f.cp.pts50', 'f.cp.pts100', 'f.cp.pts0', 'tbb', 'tbrc', 'tbwkt', 'tov', 'tov.powp', 'tov.mid', 'tov.dth', 'tbrc_powp', 'tbrc_mid', 'tbrc_dth', 'tbwkt_powp', 'tbwkt_mid', 'tbwkt_dth', 'bat_tm', 'bat', 'tr.G05', 'tr.G12', 'tr.G16', 'tr.G22', 'tr.G25', 'tr.G31', 'tr.G35', 'tr.G42', 'bow_tm', 'bow', 'tbwkt.G05', 'tbwkt.G12', 'tbwkt.G16', 'tbwkt.G22', 'tbwkt.G25', 'tbwkt.G31', 'tbwkt.G35', 'tbwkt.G42']

In [246]:

print(merged_interim_df2.tm.unique())

['Mumbai Indians']

In [247]:

display(merged_interim_df2.head(5))

,tm,name,batnum_min,m.num,tr,tbf,tbinn,tr_pp,tbf_pp,tout_pp,...,bow_tm,bow,tbwkt.G05,tbwkt.G12,tbwkt.G16,tbwkt.G22,tbwkt.G25,tbwkt.G31,tbwkt.G35,tbwkt.G42
0,Mumbai Indians,Arjun Tendulkar,9.0,4,13.0,9.0,1.0,0.0,0.0,0.0,...,Mumbai Indians,Arjun Tendulkar,NaN,NaN,NaN,0.0,2.0,1.0,1.0,NaN
1,Mumbai Indians,Arshad Khan,6.0,4,17.0,13.0,2.0,0.0,0.0,0.0,...,Mumbai Indians,Arshad Khan,1.0,0.0,0.0,NaN,NaN,NaN,NaN,3.0
2,Mumbai Indians,C Green,3.0,8,243.0,159.0,8.0,71.0,54.0,1.0,...,Mumbai Indians,C Green,1.0,0.0,0.0,1.0,1.0,2.0,0.0,0.0
3,Mumbai Indians,D Jansen,NaN,1,0.0,0.0,0.0,0.0,0.0,0.0,...,Mumbai Indians,D Jansen,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN
4,Mumbai Indians,HR Shokeen,8.0,6,23.0,16.0,2.0,0.0,0.0,0.0,...,Mumbai Indians,HR Shokeen,0.0,0.0,1.0,2.0,0.0,0.0,NaN,NaN

In [248]:

exp_file = f'pstats_{team_for_code}.xlsx'
merged_interim_df2.to_excel(exp_location + exp_file, index = False)

### Fantasy Points Totals

In [249]:
'''
#Create Fantasy pts crickpe version

pstats['bat_pts'] = master_df['rs'].fillna(0) + master_df['four'].fillna(0) + master_df['six'].fillna(0)*2 \
    + master_df['pts_for_thrty'].fillna(0) + master_df['pts_for_fifty'].fillna(0) + master_df['pts_for_hundy'].fillna(0) + master_df['pts_for_ducky'].fillna(0)

master_df['bow_pts'] = master_df['wkt'].fillna(0)*25 \
    + master_df['pts_for_3w'].fillna(0) + master_df['pts_for_4w'].fillna(0) + master_df['pts_for_5w'].fillna(0) \
        + master_df['pts_for_bow_econ'].fillna(0)

master_df['pts_crickpe'] = master_df['bat_pts'].fillna(0) + master_df['bow_pts'].fillna(0)
'''

"\n#Create Fantasy pts crickpe version\n\npstats['bat_pts'] = master_df['rs'].fillna(0) + master_df['four'].fillna(0) + master_df['six'].fillna(0)*2     + master_df['pts_for_thrty'].fillna(0) + master_df['pts_for_fifty'].fillna(0) + master_df['pts_for_hundy'].fillna(0) + master_df['pts_for_ducky'].fillna(0)\n\nmaster_df['bow_pts'] = master_df['wkt'].fillna(0)*25     + master_df['pts_for_3w'].fillna(0) + master_df['pts_for_4w'].fillna(0) + master_df['pts_for_5w'].fillna(0)         + master_df['pts_for_bow_econ'].fillna(0)\n\nmaster_df['pts_crickpe'] = master_df['bat_pts'].fillna(0) + master_df['bow_pts'].fillna(0)\n"

In [250]:

# Calculate strike rates for each phase of the game
#df_plyr_mtch['sr_powp'] = (df_plyr_mtch['tot_runs_powp'] / df_plyr_mtch['tot_balls_powp']) * 100
#df_plyr_mtch['sr_mid'] = (df_plyr_mtch['tot_runs_mid'] / df_plyr_mtch['tot_balls_mid']) * 100
#df_plyr_mtch['sr_dth'] = (df_plyr_mtch['tot_runs_dth'] / df_plyr_mtch['tot_balls_dth']) * 100